<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,640,640,3" element_type="u8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="images" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="images">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="/model.22/Constant_8" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.22/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model.22/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="2" name="Convert_305429" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_305430" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_305431" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_305432" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="36" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_305433" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_47118" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47118" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="8" name="Constant_47119" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="48" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47119" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="Constant_47120" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47120" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="10" name="Constant_47121" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="48" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47121" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="images/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="images/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_289177" type="Const" version="opset1">
			<data element_type="i8" shape="16, 3, 3, 3" offset="52" size="432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289177" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Convert_289178" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289178" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_289179" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="484" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289179" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model.0/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_140" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="548" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_140" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model.0/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_47128" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47128" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="21" name="Constant_47129" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="616" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47129" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="Constant_47130" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47130" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="23" name="Constant_47131" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="616" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47131" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="/model.0/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_289181" type="Const" version="opset1">
			<data element_type="i8" shape="32, 16, 3, 3" offset="620" size="4608" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289181" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Convert_289182" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289182" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_289183" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="5228" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289183" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model.1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/model.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_155" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="5356" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_155" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model.1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model.1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_47138" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5484" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47138" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="34" name="Constant_47139" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5488" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47139" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="35" name="Constant_47140" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5484" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47140" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="36" name="Constant_47141" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5488" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47141" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="/model.1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_289185" type="Const" version="opset1">
			<data element_type="i8" shape="32, 32, 1, 1" offset="5492" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289185" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Convert_289186" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289186" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_289187" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="6516" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289187" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model.2/cv1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model.2/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="6644" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_170" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model.2/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model.2/cv1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_46988" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6772" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46988" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="Constant_46989" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6776" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46989" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="Constant_46990" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6772" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46990" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="Constant_46991" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6776" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46991" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="50" name="/model.2/cv1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_175" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6780" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_175" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="52" name="Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="6788" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Split_141">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model.2/Split" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/Split" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Split_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="4" precision="FP32" names="/model.2/Split_output_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_289189" type="Const" version="opset1">
			<data element_type="i8" shape="16, 16, 3, 3" offset="6804" size="2304" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289189" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Convert_289190" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289190" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_289191" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="9108" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289191" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model.2/m.0/cv1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model.2/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9172" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_188" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model.2/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model.2/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_47153" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9236" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47153" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="63" name="Constant_47154" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9240" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47154" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="64" name="Constant_47155" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9236" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47155" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="Constant_47156" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9240" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47156" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="/model.2/m.0/cv1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_289193" type="Const" version="opset1">
			<data element_type="i8" shape="16, 16, 3, 3" offset="9244" size="2304" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289193" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convert_289194" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289194" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_289195" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="11548" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289195" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model.2/m.0/cv2/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model.2/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_203" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11612" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_203" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model.2/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model.2/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_47163" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11676" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47163" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="76" name="Constant_47164" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47164" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="77" name="Constant_47165" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11676" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47165" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="78" name="Constant_47166" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47166" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="/model.2/m.0/cv2/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model.2/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_46983" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6772" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46983" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="Constant_46984" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6776" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46984" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="Constant_46985" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6772" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46985" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="84" name="Constant_46986" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6776" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46986" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="/model.2/m.0/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/Add/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model.2/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/Concat" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Concat_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_289197" type="Const" version="opset1">
			<data element_type="i8" shape="32, 48, 1, 1" offset="11684" size="1536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289197" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Convert_289198" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289198" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_289199" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="13220" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289199" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model.2/cv2/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model.2/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_220" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="13348" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_220" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model.2/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model.2/cv2/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_47173" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47173" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="96" name="Constant_47174" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13476" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47174" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="97" name="Constant_47175" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47175" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="98" name="Constant_47176" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13476" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_47176" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="99" name="/model.2/cv2/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_289201" type="Const" version="opset1">
			<data element_type="i8" shape="64, 32, 3, 3" offset="13480" size="18432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289201" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Convert_289202" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_289202" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_289203" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="31912" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289203" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model.3/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.3/conv/Conv/WithoutBiases/fq_weights_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model.3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.3/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
